app/Filament/Resources/CustomerResource/Pages/ListCustomers.php

    public function getTabs(): array
    {
        $tabs = [];

        // Adding `all` as our first tab
        $tabs['all'] = Tab::make('All Customers')
            // We will add a badge to show how many customers are in this tab
            ->badge(Customer::count());

        if (!auth()->user()->isAdmin()) {
            $tabs['my'] = Tab::make('My Customers')
                ->badge(Customer::where('employee_id', auth()->id())->count())
                ->modifyQueryUsing(function ($query) {
                    return $query->where('employee_id', auth()->id());
                });
---
select count(*) as aggregate from `customers` where `customers`.`deleted_at` is null
select count(*) as aggregate from `customers` where `employee_id` = 1 and `customers`.`deleted_at` is null

                });
        }

        $tabs['archived'] = Tab::make('Archived')
            ->badge(Customer::onlyTrashed()->count())
            ->modifyQueryUsing(function ($query) {
                return $query->onlyTrashed();
            });
---
select count(*) as aggregate from `customers` where `customers`.`deleted_at` is not null