app/Livewire/AcceptInvitation.php

select * from `invitations` where `invitations`.`id` = 2 limit 1
---
    public function mount(): void
    {
        $this->invitationModel = Invitation::findOrFail($this->invitation);

select * from `invitations` where `invitations`.`id` = 2 limit 1
select * from `roles` where `name` = 'Employee' limit 1
---
    public function create(): void
    {
        $this->invitationModel = Invitation::find($this->invitation);

        $user = User::create([
            'name' => $this->form->getState()['name'],
            'password' => $this->form->getState()['password'],
            'email' => $this->invitationModel->email,
            'role_id' => Role::where('name', 'Employee')->first()->id