app/Http/Controllers/QuotePdfController.php

select * from `customers` where `customers`.`id` in (1) and `customers`.`deleted_at` is null
select * from `products` where `products`.`id` in (7, 10)
---
    public function __invoke(Request $request, Quote $quote)
    {
        $quote->load(['quoteProducts.product', 'customer']);