app/Filament/Resources/CustomerResource.php

    public static function form(Form $form): Form
    {
        return $form
            ->schema([
                Forms\Components\TextInput::make('first_name')
                    ->maxLength(255),
                Forms\Components\TextInput::make('last_name')
                    ->maxLength(255),
                Forms\Components\TextInput::make('email')
                    ->email()
                    ->maxLength(255),
                Forms\Components\TextInput::make('phone_number')
                    ->tel()
                    ->maxLength(255),
                Forms\Components\Textarea::make('description')
                    ->maxLength(65535)
                    ->columnSpanFull(),
                Forms\Components\Select::make('lead_source_id')
                    ->relationship('leadSource', 'name'),
                Forms\Components\Select::make('tags')
                    ->relationship('tags', 'name')
                    ->multiple(),
                Forms\Components\Select::make('pipeline_stage_id')
                    ->relationship('pipelineStage', 'name', function ($query) {
                        // It is important to order by position to display the correct order
                        $query->orderBy('position', 'asc');
                    })
                    // We are setting the default value to the default Pipeline Stage
                    ->default(PipelineStage::where('is_default', true)->first()?->id),
---
select * from `pipeline_stages` where `is_default` = 1 limit 1