app/Models/Customer.php

select * from `customer_pipeline_stages` where `customer_pipeline_stages`.`customer_id` = 1 and `customer_pipeline_stages`.`customer_id` is not null and `employee_id` is not null order by `created_at` desc limit 1
---
    public static function booted(): void
    {
        self::created(function (Customer $customer) {
            $customer->pipelineStageLogs()->create([
                'pipeline_stage_id' => $customer->pipeline_stage_id,
                'employee_id' => $customer->employee_id,
                'user_id' => auth()->check() ? auth()->id() : null
            ]);
        });

        self::updated(function (Customer $customer) {
            $lastLog = $customer->pipelineStageLogs()->whereNotNull('employee_id')->latest()->first();