app/Models/User.php

    public function isAdmin(): bool
    {
        if (!$this->relationLoaded('role')) {
            $this->load('role');
---
select * from `roles` where `roles`.`id` in (3)