app/Filament/Resources/UserResource/Pages/ListUsers.php

    protected function getHeaderActions(): array
    {
        return [
            Actions\Action::make('inviteUser')
                ->form([
                    TextInput::make('email')
                        ->email()
                        ->required()
                ])
                ->action(function ($data) {
                    $invitation = Invitation::create(['email' => $data['email']]);
---
insert into `invitations` (`email`, `updated_at`, `created_at`) values ('flatley.ashley@example.net', '2023-11-15 13:53:02', '2023-11-15 13:53:02')