app/Filament/Pages/ManageCustomerStages.php

select * from `pipeline_stages` order by `position` asc
---
    protected function statuses(): Collection
    {
        return PipelineStage::query()
            ->orderBy('position')
            ->get()
            ->map(function (PipelineStage $stage) {
                return [
                    'id' => $stage->id,
                    'title' => $stage->name,
                ];
            });

select * from `customers` where `customers`.`deleted_at` is null
---
    protected function records(): Collection
    {
        return Customer::all()
            ->map(function (Customer $item) {
                return [
                    'id' => $item->id,
                    'title' => $item->first_name . ' ' . $item->last_name,
                    'status' => $item->pipeline_stage_id,
                ];
            });